docs/Topics/Math.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-21 Mon 12:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Math</title>
<meta name="author" content="Elle Najt" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://orgmode.org/worg/style/worg.css"/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Math</h1>
<p>
Here are the math topics I&rsquo;m interested in:<br />
</p>

<div id="outline-container-org15168d1" class="outline-2">
<h2 id="org15168d1">Statistics \(\mathbb{P}(A)\)</h2>
<div class="outline-text-2" id="text-org15168d1">
<p>
It&rsquo;s pretty cool that we can understand things about the world from limited data; probability is a microscope!<br />
</p>
</div>
</div>

<div id="outline-container-orgb2492cb" class="outline-2">
<h2 id="orgb2492cb">Assorted Pure Math  \(\mathcal{F}(X)\)</h2>
<div class="outline-text-2" id="text-orgb2492cb">
<p>
Here are some of my favorite theorems:<br />
</p>
<ul class="org-ul">
<li>27 Lines on a smooth cubic, in particular the argument via the 27 fold covering of the parameter space of smooth cubics with the configuration space of (Cubic, Line).<br /></li>
<li><a href="https://en.wikipedia.org/wiki/Steinitz%27s_theorem">Steinitz&rsquo;s theorem</a> : The graphs of 3 polytopes are the 3-vertex connected planar graphs!<br /></li>
<li>Rapid mixing of the basis-exchange-walk on spanning trees of a graph: Take a graph \(G\), and let \(\mathcal{T}\) be the set of spanning trees of the graph. There is a random walk on \(\mathcal{T}\) wherein standing at a tree \(T\) you take an edge in \(G \setminus E(T)\) &#x2013; in \(G\) but not an edge of \(T\) - and add it to T, forming a cycle in \(T\),  and then you delete a random edge in that cycle. This mixes rapidly, so after a polynomial in \(|G|\) number of steps you&rsquo;re at approximately a uniformly random spanning tree.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgf9d27b7" class="outline-2">
<h2 id="orgf9d27b7">Research</h2>
<div class="outline-text-2" id="text-orgf9d27b7">
<p>
In graduate school I did research on Markov chains that were being used to analyze political redistricting, along with some related problems. <a href="GradSchoolResearch.html">You can find an overview of my research here.</a><br />
</p>
</div>
</div>

<div id="outline-container-orgb1606f3" class="outline-2">
<h2 id="orgb1606f3">Competition Math \(x + y \geq 2\sqrt{xy}\)</h2>
<div class="outline-text-2" id="text-orgb1606f3">
<p>
I wasn&rsquo;t successful at competition math in high school, so I&rsquo;m enjoying learning how to become good at it as a means of doing some emotional processing and improving my general problem solving skills. I&rsquo;m doing this by working with a tutor who is better than me at solving mathematical problems and we are working through Engel&rsquo;s &ldquo;Problem-Solving strategies.&rdquo;<br />
</p>
</div>

<div id="outline-container-org83ed64b" class="outline-3">
<h3 id="org83ed64b">Some problem solving lessons I&rsquo;m learning:</h3>
<div class="outline-text-3" id="text-org83ed64b">
</div>
<div id="outline-container-org6345b8b" class="outline-4">
<h4 id="org6345b8b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-10-05 Sat&gt;</span></span></h4>
<div class="outline-text-4" id="text-org6345b8b">
<p>
Noticed that I got fixated on solving one of the example problems. I did eventually solve it, which I felt really good about, though I found a different solution from the one in the book, meaning that from my struggles I didn&rsquo;t learn how the problem was an example of the problem solving technique of invariants.<br />
</p>

<p>
I reflect on how I had internalized the idea that it is virtuous to struggle to solve a problem, which I am questioning - certainly there is virtue in solving hard problems, and value in developing the skill of being okay with frustration. But I think the &ldquo;struggle with problems&rdquo; mindset is one that makes the most sense when at the core ideas have been learned, and my goal here is to become a better mathematical problem solver. I discussed this with my tutor, and he cited some research showing that studying diversity of topics and simply doing a lot of problems is more effective, and we both agreed that it made sense to <a href="SoftwareDevelopment.html#org39568f6">optimize for fun</a>.<br />
</p>

<p>
As we were working on another problem I started thinking about how it was hard to let go of an approach to a problem, even when I&rsquo;ve become convinced that it won&rsquo;t work, because of the appeal of an idea working out.<br />
</p>

<p>
There is a useful <a href="Personal.html#orgb01ecb7">forgiveness practice</a> here also: forgiveness for not being able to come up with an idea, and forgiveness for an approach not working. I wonder if practice that in this context will make my attitudes more fluid.<br />
</p>
</div>
</div>

<div id="outline-container-orgc7afa09" class="outline-4">
<h4 id="orgc7afa09"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-26 Thu&gt;</span></span></h4>
<div class="outline-text-4" id="text-orgc7afa09">
<p>
I can get stuck in an overly formal way of thinking about problems; e.g. pattern matching what I see against facts I know. It can be useful to notice mindfully when I&rsquo;m in that mindset and step back into a more heuristic and embodied mindframe.<br />
</p>
</div>
</div>

<div id="outline-container-org62b57ea" class="outline-4">
<h4 id="org62b57ea"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-09-19 Thu&gt;</span></span></h4>
<div class="outline-text-4" id="text-org62b57ea">
<p>
Mistakes can lead to solutions; it&rsquo;s important to not avoid thinking about how to correct an error out of avoidant shame around doing something &ldquo;dumb.&rdquo; This effect can be very subtle! Forgive yourself for not understanding. ^^<br />
</p>

<div class="org-src-container">
<pre class="src src-qoute">To fear the error and to fear the truth are one and the same. One who fears to
be wrong is powerless to discover. It is when we are afraid of making mistakes
that the mistake inside us becomes immovable like a rock.  Because in our fear,
we cling to what we have decreed to be “true”, or what has always been presented
to us as “true”. If we are moved, not by the fear of seeing an illusory security
vanish, but by a thirst for knowing, then error, like suffering or sorrow, will
cross us without ever becoming frozen, and the trace of its passage will be a
renewed understanding.
- Alexander Grothendieck
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Elle Najt</p>
<p class="email">Email: <a href="mailto:LNAJT4@gmail.com">LNAJT4@gmail.com</a></p>
<p class="date">Created: 2024-10-21 Mon 12:14</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
